In [1]:
import pandas as pd
import matplotlib as plt
import numpy as np

In [2]:
dane=pd.read_csv('sales_data_practice.csv')

In [3]:
#dane.head()
#dane.shape
dane.info()
#dane.columns
dane['date']=pd.to_datetime(dane['date'])
dane.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     200 non-null    int64
 1   date         200 non-null    object
 2   product      200 non-null    object
 3   quantity     200 non-null    int64
 4   unit_price   200 non-null    int64
 5   total_value  200 non-null    int64
 6   region       200 non-null    object
 7   sales_rep    200 non-null    object
dtypes: int64(4), object(4)
memory usage: 12.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     200 non-null    int64
 1   date         200 non-null    datetime64[ns]
 2   product      200 non-null    object
 3   quantity     200 non-null    int64
 4   unit_price   200 non-null    int64
 5   total_value  200 non-null    int64
 6   region       200 non-null    object
 7   sales_rep    200 non-null    object
dtypes: datetime64[ns](1), int64(4), object(3)
memory usage: 12.6+ KB

In [31]:
dane['month']=dane['date'].dt.month

In [32]:
dane.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     200 non-null    int64
 1   date         200 non-null    datetime64[ns]
 2   product      200 non-null    object
 3   quantity     200 non-null    int64
 4   unit_price   200 non-null    int64
 5   total_value  200 non-null    int64
 6   region       200 non-null    object
 7   sales_rep    200 non-null    object
 8   month        200 non-null    int32
dtypes: datetime64[ns](1), int32(1), int64(4), object(3)
memory usage: 13.4+ KB

In [33]:
Sprzedaż_miesiac=dane.groupby('month')['total_value'].sum()
Sprzedaż_miesiac.sort_values(ascending=False)
#dane.groupby('month')['total_value'].mean()

month
11    106050
6      88350
3      85950
4      79620
5      77400
2      55170
9      54650
10     46890
8      45950
12     41710
1      37760
7      25360
Name: total_value, dtype: int64

In [34]:
Sprzedaż_Asortyment=dane.groupby('product')['total_value'].sum()
Sprzedaż_Asortyment.sort_values(ascending=False)

dane['total_value'].mean()

dane.groupby('region')['total_value'].mean().sort_values(ascending=False)
dane.groupby('sales_rep')['total_value'].sum().sort_values(ascending=False)
dane.groupby('sales_rep')['order_id'].sum().sort_values(ascending=False)
dane.groupby('sales_rep')['total_value'].mean().sort_values(ascending=False)

sales_rep
Anna     4881.489362
Marek    3820.677966
Kasia    3596.590909
Piotr    2635.200000
Name: total_value, dtype: float64

In [35]:
dane.groupby('month')['total_value'].sum().sort_values(ascending=False).reset_index()
#dane.groupby('product')['total_value'].sum().sort_values(ascending=False)
#(dane.groupby('product')['total_value'].sum() / dane['total_value'].sum() * 100).sort_values(ascending=False)

    month  total_value
0      11       106050
1       6        88350
2       3        85950
3       4        79620
4       5        77400
5       2        55170
6       9        54650
7      10        46890
8       8        45950
9      12        41710
10      1        37760
11      7        25360

In [11]:
#dane.groupby('sales_rep')['total_value'].sum().sort_values(ascending=False)
dane.groupby('sales_rep')['total_value'].mean().sort_values(ascending=False)
pd=dane.groupby('sales_rep')['total_value'].mean().sort_values(ascending=False)

In [12]:
dane.groupby('sales_rep')['total_value'].agg(['sum','mean']).sort_values('sum', ascending=False)

              sum         mean
sales_rep
Anna       229430  4881.489362
Marek      225420  3820.677966
Kasia      158250  3596.590909
Piotr      131760  2635.200000

In [13]:
#dane.groupby('sales_rep')['total_value'].agg(['sum','mean']).sort_values('sum', ascending=False).head(1)
monthly_product_sales = (
    dane.groupby(['month', 'product'])['total_value']
    .sum()
    .reset_index()
)
monthly_product_sales.head()
#pivot_table = monthly_product_sales.pivot(
   # index='month',
  #  columns='product',
 #   values='total_value'
#)

#pivot_table
#import matplotlib.pyplot as plt

#pivot_table.plot(figsize=(10,6))

#plt.title("Miesięczna sprzedaż per produkt")
#plt.xlabel("Miesiąc")
#plt.ylabel("Sprzedaż")
#plt.xticks(range(1,13))
#plt.grid(True)

#plt.show()

   month     product  total_value
0      1  Headphones         3000
1      1    Keyboard          600
2      1      Laptop        28000
3      1     Monitor         6000
4      1       Mouse          160

In [26]:
dane[dane['product']=='Laptop']
dane[(dane['product'] == 'Laptop') & (dane['quantity'] == 3)]
dane
#dane['product']

,order_id,date,product,quantity,unit_price,total_value,region,sales_rep
0,1,2025-04-21,Mouse,2,80,160,West,Kasia
1,2,2025-01-06,Laptop,5,4000,20000,North,Anna
2,3,2025-09-20,Headphones,2,300,600,West,Marek
3,4,2025-12-31,Keyboard,2,150,300,South,Piotr
4,5,2025-03-27,Laptop,2,4000,8000,West,Anna
...,...,...,...,...,...,...,...,...
195,196,2025-02-06,Keyboard,2,150,300,South,Marek
196,197,2025-11-10,Laptop,4,4000,16000,West,Anna
197,198,2025-03-27,Mouse,3,80,240,South,Kasia
198,199,2025-11-22,Headphones,2,300,600,East,Anna
199,200,2025-10-15,Headphones,2,300,600,North,Marek

In [17]:
dane['date'].reset_index().sort_values(by='date',ascending=True)

     index       date
1        1 2025-01-06
137    137 2025-01-10
120    120 2025-01-10
68      68 2025-01-20
140    140 2025-01-23
..     ...        ...
73      73 2025-12-28
170    170 2025-12-28
122    122 2025-12-30
161    161 2025-12-30
3        3 2025-12-31

[200 rows x 2 columns]